Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
.module.lambda-customMessageLambdaTrigger.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.cognito.module.lambda-sendRegistrationEmail.data.aws_partition.current: Read complete after 0s [id=aws]
module.cognito.module.lambda-sendRegistrationEmail.data.aws_region.current: Reading...
module.cognito.data.aws_iam_policy_document.gaspi_authenticated_role_policy: Reading...
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_caller_identity.current: Read complete after 0s [id=438465168484]
module.cognito.module.lambda-logEmailDelivery.data.aws_iam_policy_document.assume_role[0]: Reading...
module.cognito.data.aws_iam_policy_document.manager_group_role_policy: Reading...
module.cognito.module.lambda-logEmailDelivery.data.aws_caller_identity.current: Reading...
module.cognito.module.lambda-sendRegistrationEmail.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.cognito.data.aws_iam_policy_document.gaspi_authenticated_role_policy: Read complete after 0s [id=2449066735]
module.cognito.module.lambda-logEmailDelivery.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.cognito.module.lambda-logEmailDelivery.data.aws_partition.current: Reading...
module.cognito.data.aws_iam_policy_document.manager_group_role_policy: Read complete after 0s [id=2117676676]
module.cognito.module.lambda-logEmailDelivery.data.aws_region.current: Reading...
module.cognito.module.lambda-logEmailDelivery.data.aws_partition.current: Read complete after 0s [id=aws]
module.cognito.data.aws_iam_policy_document.admin_group_role_policy: Reading...
module.cognito.module.lambda-logEmailDelivery.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.cognito.module.lambda-sendRegistrationEmail.data.aws_caller_identity.current: Reading...
module.cognito.data.aws_iam_policy_document.admin_group_role_policy: Read complete after 0s [id=1269268040]
module.cognito.module.lambda-logEmailDelivery.data.aws_caller_identity.current: Read complete after 0s [id=438465168484]
module.cognito.module.lambda-sendRegistrationEmail.data.aws_caller_identity.current: Read complete after 0s [id=438465168484]
module.pgxflow[0].module.lambda-qcFigures.data.aws_iam_policy_document.assume_role[0]: Reading...
module.pgxflow[0].module.lambda-qcFigures.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.security.data.aws_iam_policy_document.lambda-sendSecurityAlert: Reading...
module.security.data.aws_iam_policy_document.lambda-sendSecurityAlert: Read complete after 0s [id=1000390934]
module.sbeacon.data.aws_iam_policy_document.lambda-generateReports: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-generateReports: Read complete after 0s [id=1355932973]
module.webgui.data.aws_cloudfront_cache_policy.bui-s3-distribution-cache-policy: Read complete after 1s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.data.aws_iam_policy_document.assume_role[0]: Reading...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.data.aws_iam_policy.AWSGlueServiceRole: Read complete after 1s [id=arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.data.aws_iam_policy_document.assume_role[0]: Reading...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.data.aws_iam_policy_document.assume_role[0]: Reading...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.data.aws_iam_policy_document.assume_role[0]: Reading...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.data.aws_iam_policy_document.assume_role[0]: Reading...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.data.aws_iam_policy_document.assume_role[0]: Reading...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.data.aws_iam_policy_document.assume_role[0]: Reading...
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.data.aws_iam_policy_document.assume_role[0]: Reading...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.data.aws_iam_policy_document.assume_role[0]: Reading...
module.pgxflow[0].module.pipeline_lookup.module.lambda-getResultsURL.data.aws_iam_policy_document.assume_role[0]: Reading...
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.data.aws_iam_policy_document.assume_role[0]: Reading...
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.data.aws_iam_policy_document.assume_role[0]: Reading...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.pgxflow[0].module.pipeline_lookup.module.lambda-getResultsURL.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.data.aws_iam_policy_document.assume_role[0]: Reading...
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.data.aws_iam_policy_document.assume_role[0]: Reading...
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.data.aws_iam_policy_document.assume_role[0]: Reading...
module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # aws_backup_plan.gaspi_backup_plan will be created
  + resource "aws_backup_plan" "gaspi_backup_plan" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "gaspi_backup_plan"
      + tags     = {
          + "Environment" = "uat"
          + "Owner"       = "gaspi"
        }
      + tags_all = {
          + "Environment" = "uat"
          + "Owner"       = "gaspi"
        }
      + version  = (known after apply)

      + rule {
          + completion_window            = 180
          + enable_continuous_backup     = false
          + rule_name                    = "weekly"
          + schedule                     = "cron(0 20 ? * SUN *)"
          + schedule_expression_timezone = "Etc/UTC"
          + start_window                 = 60
          + target_vault_name            = "gaspi_backup_vault"

          + lifecycle {
              + delete_after                              = 30
              + opt_in_to_archive_for_supported_resources = (known after apply)
            }
        }
      + rule {
          + completion_window            = 180
          + enable_continuous_backup     = false
          + rule_name                    = "yearly"
          + schedule                     = "cron(0 22 1 1 ? *)"
          + schedule_expression_timezone = "Etc/UTC"
          + start_window                 = 60
          + target_vault_name            = "gaspi_backup_vault"

          + lifecycle {
              + delete_after                              = 3650
              + opt_in_to_archive_for_supported_resources = (known after apply)
            }
        }
      + rule {
          + completion_window            = 180
          + enable_continuous_backup     = false
          + rule_name                    = "monthly"
          + schedule                     = "cron(0 21 1 * ? *)"
          + schedule_expression_timezone = "Etc/UTC"
          + start_window                 = 60
          + target_vault_name            = "gaspi_backup_vault"

          + lifecycle {
              + delete_after                              = 365
              + opt_in_to_archive_for_supported_resources = (known after apply)
            }
        }
      + rule {
          + completion_window            = 180
          + enable_continuous_backup     = false
          + rule_name                    = "daily"
          + schedule                     = "cron(0 19 * * ? *)"
          + schedule_expression_timezone = "Etc/UTC"
          + start_window                 = 60
          + target_vault_name            = "gaspi_backup_vault"

          + lifecycle {
              + delete_after                              = 7
              + opt_in_to_archive_for_supported_resources = (known after apply)
            }
        }
    }

  # aws_backup_selection.gaspi_backup_selection will be created
  + resource "aws_backup_selection" "gaspi_backup_selection" {
      + iam_role_arn  = (known after apply)
      + id            = (known after apply)
      + name          = "gaspi_backup_resource_selection"
      + not_resources = (known after apply)
      + plan_id       = (known after apply)

      + condition (known after apply)

      + selection_tag {
          + key   = "backup"
          + type  = "STRINGEQUALS"
          + value = "true"
        }
    }

  # aws_backup_vault.gaspi_backup_vault will be created
  + resource "aws_backup_vault" "gaspi_backup_vault" {
      + arn             = (known after apply)
      + force_destroy   = false
      + id              = (known after apply)
      + kms_key_arn     = (known after apply)
      + name            = "gaspi_backup_vault"
      + recovery_points = (known after apply)
      + tags            = {
          + "Environment" = "uat"
          + "Owner"       = "gaspi"
        }
      + tags_all        = {
          + "Environment" = "uat"
          + "Owner"       = "gaspi"
        }
    }

  # aws_iam_role.gaspi_backup_role will be created
  + resource "aws_iam_role" "gaspi_backup_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "backup.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gaspi_backup_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.gaspi_backup_role_attachment will be created
  + resource "aws_iam_role_policy_attachment" "gaspi_backup_role_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSBackupServiceRolePolicyForBackup"
      + role       = "gaspi_backup_role"
    }

  # aws_iam_role_policy_attachment.gaspi_backup_s3_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "gaspi_backup_s3_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSBackupServiceRolePolicyForS3Backup"
      + role       = "gaspi_backup_role"
    }

  # aws_iam_role_policy_attachment.gaspi_restore_s3_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "gaspi_restore_s3_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSBackupServiceRolePolicyForS3Restore"
      + role       = "gaspi_backup_role"
    }

  # module.cognito.data.aws_iam_policy_document.lambda-sendClinicJobEmail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-sendClinicJobEmail" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ses:SendEmail",
            ]
          + resources = [
              + "arn:aws:ses:ap-southeast-3:438465168484:identity/*",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + resources = [
              + "arn:aws:ssm:ap-southeast-3:438465168484:parameter/bui-ssm-beacon-ui-url",
            ]
        }
    }

  # module.cognito.data.aws_iam_policy_document.lambda-sendRegistrationEmail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-sendRegistrationEmail" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ses:SendEmail",
            ]
          + resources = [
              + "arn:aws:ses:ap-southeast-3:438465168484:identity/*",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + resources = [
              + "arn:aws:ssm:ap-southeast-3:438465168484:parameter/bui-ssm-beacon-ui-url",
            ]
        }
    }

  # module.cognito.data.aws_iam_policy_document.ses-sns-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ses-sns-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowSESToPublishToSNS"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "438465168484",
                ]
              + variable = "aws:SourceAccount"
            }

          + principals {
              + identifiers = [
                  + "ses.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.cognito.aws_iam_policy.admin_group_role_policy will be created
  + resource "aws_iam_policy" "admin_group_role_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "admin group permissions"
      + id               = (known after apply)
      + name             = "gaspi-admin-group-role-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gaspi-dataportal-*/projects/*"
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Condition = {
                          + StringLike = {
                              + "s3:prefix" = [
                                  + "private/${cognito-identity.amazonaws.com:sub}/",
                                  + "private/${cognito-identity.amazonaws.com:sub}/*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:s3:::gaspi-dataportal-*"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gaspi-dataportal-*/private/${cognito-identity.amazonaws.com:sub}/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
    }

  # module.cognito.aws_iam_policy.manager_group_role_policy will be created
  + resource "aws_iam_policy" "manager_group_role_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "manager group permissions"
      + id               = (known after apply)
      + name             = "gaspi-manager-group-role-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gaspi-dataportal-*/projects/*"
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Condition = {
                          + StringLike = {
                              + "s3:prefix" = [
                                  + "private/${cognito-identity.amazonaws.com:sub}/",
                                  + "private/${cognito-identity.amazonaws.com:sub}/*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:s3:::gaspi-dataportal-*"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gaspi-dataportal-*/private/${cognito-identity.amazonaws.com:sub}/*"
                    },
                  + {
                      + Action   = "pricing:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
    }

  # module.cognito.aws_lambda_permission.SNSemailNotification will be created
  + resource "aws_lambda_permission" "SNSemailNotification" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "CognitoBackendAllowSNSemailNotificationInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.cognito.aws_ses_configuration_set.ses_feedback_config will be created
  + resource "aws_ses_configuration_set" "ses_feedback_config" {
      + arn                        = (known after apply)
      + id                         = (known after apply)
      + last_fresh_start           = (known after apply)
      + name                       = "ses-feedback-config"
      + reputation_metrics_enabled = false
      + sending_enabled            = true
    }

  # module.cognito.aws_ses_event_destination.ses_feedback_event_destination will be created
  + resource "aws_ses_event_destination" "ses_feedback_event_destination" {
      + arn                    = (known after apply)
      + configuration_set_name = "ses-feedback-config"
      + enabled                = true
      + id                     = (known after apply)
      + matching_types         = [
          + "bounce",
          + "complaint",
          + "delivery",
        ]
      + name                   = "ses-feedback-event-destination"

      + sns_destination {
          + topic_arn = (known after apply)
        }
    }

  # module.cognito.aws_sns_topic.sesDeliveryLogger will be created
  + resource "aws_sns_topic" "sesDeliveryLogger" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "sesDeliveryLogger"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tracing_config              = (known after apply)
    }

  # module.cognito.aws_sns_topic_policy.sesDeliveryLogger will be created
  + resource "aws_sns_topic_policy" "sesDeliveryLogger" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
    }

  # module.cognito.aws_sns_topic_subscription.sesDeliveryLogger will be created
  + resource "aws_sns_topic_subscription" "sesDeliveryLogger" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.pgxflow[0].data.aws_iam_policy_document.ec2_references_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ec2_references_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].data.aws_iam_policy_document.lambda-qcFigures will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-qcFigures" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].archive_file.binaries_layer will be created
  + resource "archive_file" "binaries_layer" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "pgxflow/binaries.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "pgxflow/layers/binaries/"
      + type                = "zip"
    }

  # module.pgxflow[0].aws_api_gateway_integration.vcfstats-options will be created
  + resource "aws_api_gateway_integration" "vcfstats-options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.pgxflow[0].aws_api_gateway_integration_response.vcfstats-options will be created
  + resource "aws_api_gateway_integration_response" "vcfstats-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,PATCH,POST'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = null
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.pgxflow[0].aws_api_gateway_method.vcfstats-options will be created
  + resource "aws_api_gateway_method" "vcfstats-options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.pgxflow[0].aws_api_gateway_method_response.vcfstats-options will be created
  + resource "aws_api_gateway_method_response" "vcfstats-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.pgxflow[0].aws_api_gateway_resource.vcfstats will be created
  + resource "aws_api_gateway_resource" "vcfstats" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "vcfstats"
      + rest_api_id = (known after apply)
    }

  # module.pgxflow[0].aws_api_gateway_rest_api.PgxApi will be created
  + resource "aws_api_gateway_rest_api" "PgxApi" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "API That implements the Pharmacogenomics workflow"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "pgxflow-backend-api"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + ip_address_type  = (known after apply)
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.pgxflow[0].aws_cloudfront_cache_policy.api will be created
  + resource "aws_cloudfront_cache_policy" "api" {
      + arn         = (known after apply)
      + default_ttl = 0
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 0
      + min_ttl     = 0
      + name        = "pgxflow-backend-api"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + cookies_config {
              + cookie_behavior = "none"
            }
          + headers_config {
              + header_behavior = "none"
            }
          + query_strings_config {
              + query_string_behavior = "none"
            }
        }
    }

  # module.pgxflow[0].aws_cloudfront_origin_request_policy.api will be created
  + resource "aws_cloudfront_origin_request_policy" "api" {
      + arn  = (known after apply)
      + etag = (known after apply)
      + id   = (known after apply)
      + name = "pgxflow-backend-api"

      + cookies_config {
          + cookie_behavior = "none"
        }

      + headers_config {
          + header_behavior = "allExcept"

          + headers {
              + items = [
                  + "Host",
                ]
            }
        }

      + query_strings_config {
          + query_string_behavior = "all"
        }
    }

  # module.pgxflow[0].aws_dynamodb_table.pgxflow_references will be created
  + resource "aws_dynamodb_table" "pgxflow_references" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "pgxflow-references"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.pgxflow[0].aws_iam_instance_profile.ec2_references_instance_profile will be created
  + resource "aws_iam_instance_profile" "ec2_references_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "pgxflow_backend_ec2_references_instance_profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "pgxflow_backend_ec2_references_instance_role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.pgxflow[0].aws_iam_role.ec2_references_instance_role will be created
  + resource "aws_iam_role" "ec2_references_instance_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow_backend_ec2_references_instance_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].aws_iam_role_policy.ec2_references_policy will be created
  + resource "aws_iam_role_policy" "ec2_references_policy" {
      + id          = (known after apply)
      + name        = "pgxflow_backend_ec2_references_policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.pgxflow[0].aws_lambda_layer_version.binaries_layer will be created
  + resource "aws_lambda_layer_version" "binaries_layer" {
      + arn                         = (known after apply)
      + code_sha256                 = (known after apply)
      + compatible_runtimes         = [
          + "python3.12",
        ]
      + created_date                = (known after apply)
      + filename                    = "pgxflow/binaries.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "pgxflow_backend_binaries_layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # module.pgxflow[0].aws_s3_bucket.lambda-layers-bucket will be created
  + resource "aws_s3_bucket" "lambda-layers-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "pgxflow-backend-layers-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.pgxflow[0].aws_s3_bucket.pgxflow-bucket will be created
  + resource "aws_s3_bucket" "pgxflow-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "pgxflow-backend-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.pgxflow[0].aws_s3_bucket.pgxflow-references will be created
  + resource "aws_s3_bucket" "pgxflow-references" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "pgxflow-backend-references-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.pgxflow[0].aws_s3_bucket_versioning.pgxflow-references will be created
  + resource "aws_s3_bucket_versioning" "pgxflow-references" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.pgxflow[0].null_resource.init_script will be created
  + resource "null_resource" "init_script" {
      + id       = (known after apply)
      + triggers = {
          + "script_path" = "861971d565caac9b1c8c9f4daab5d26c54843116"
        }
    }

  # module.sbeacon.data.archive_file.binaries_layer will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "binaries_layer" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "sbeacon/binaries.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "sbeacon/layers/binaries/"
      + type                = "zip"
    }

  # module.sbeacon.data.aws_iam_policy_document.athena-full-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "athena-full-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "athena:GetQueryExecution",
              + "athena:GetQueryResults",
              + "athena:StartQueryExecution",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "glue:*",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.athena-readonly-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "athena-readonly-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "athena:GetQueryExecution",
              + "athena:GetQueryResults",
              + "athena:StartQueryExecution",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "glue:*",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.dataportal-locks-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dataportal-locks-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.dynamodb-onto-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dynamodb-onto-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:Scan",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.dynamodb-onto-write-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dynamodb-onto-write-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.dynamodb-quota-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dynamodb-quota-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.ec2_deidentification_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ec2_deidentification_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/project-files/*",
                  + "staging/projects/*/project-files/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.extra-glue-policy-document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "extra-glue-policy-document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketAcl",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListAllMyBuckets",
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-deidentifyFiles will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-deidentifyFiles" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:HeadObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
              + "ec2:DescribeImages",
              + "ec2:DescribeInstances",
              + "ec2:RunInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getAnalyses will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getAnalyses" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getBiosamples will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getBiosamples" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getDatasets will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getDatasets" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getGenomicVariants will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getGenomicVariants" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getIndividuals will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getIndividuals" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getProjects will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getProjects" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getRuns will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getRuns" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-splitQuery will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-splitQuery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-updateFiles will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-updateFiles" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/project-files/*",
                  + "staging/projects/*/project-files/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.aws_api_gateway_integration.projects will be created
  + resource "aws_api_gateway_integration" "projects" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration_response.projects will be created
  + resource "aws_api_gateway_integration_response" "projects" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_method.projects will be created
  + resource "aws_api_gateway_method" "projects" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method_response.projects will be created
  + resource "aws_api_gateway_method_response" "projects" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_resource.admin will be created
  + resource "aws_api_gateway_resource" "admin" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "admin"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.admin_proxy will be created
  + resource "aws_api_gateway_resource" "admin_proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.analyses will be created
  + resource "aws_api_gateway_resource" "analyses" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "analyses"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.analyses-filtering_terms will be created
  + resource "aws_api_gateway_resource" "analyses-filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.analyses-id will be created
  + resource "aws_api_gateway_resource" "analyses-id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.analyses-id-g_variants will be created
  + resource "aws_api_gateway_resource" "analyses-id-g_variants" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "g_variants"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.biosamples will be created
  + resource "aws_api_gateway_resource" "biosamples" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "biosamples"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.biosamples-filtering_terms will be created
  + resource "aws_api_gateway_resource" "biosamples-filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.biosamples-id will be created
  + resource "aws_api_gateway_resource" "biosamples-id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.biosamples-id-analyses will be created
  + resource "aws_api_gateway_resource" "biosamples-id-analyses" {
      + 
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.